package com.viger.plugin;

public class Constant {
    public static final String[] one = {" 日和莉 ", " 怜 ", " 未奏希 ", " 胡桃 ", " 依里 ", " 由加莉 ", " 铃莓 ", " 碧 ", " 美咲 ", " 莉玛 "};
    public static final String[] noUpOne = {" 日和莉 ", " 怜 ", " 未奏希 ", " 依里 ", " 由加莉 ", " 碧 ", " 美咲 ", " 莉玛 "};
    public static final String[] two = {" 茜里 ", " 宫子 ", " 雪 ", " 铃奈 ", " 香织 ", " 美美 ", " 惠理子 ", " 忍 ", " 真阳 ", " 栞 ", " 千歌 ", " 空花 ", " 珠希 ", " 美冬 ", " 深月 ", " 铃 "};
    public static final String[] noUpTwo = {" 茜里 ", " 宫子 ", " 雪 ", " 铃奈 ", " 香织 ", " 美美 ", " 惠理子 ", " 忍 ", " 真阳 ", " 栞 ", " 千歌 ", " 空花 ", " 珠希 ", " 美冬 ", " 深月 ", " 铃 "};
    public static final String[] Three = {" 杏奈 ", " 真步 ", " 璃乃 ", " 初音 ", " 依绪 ", " 咲恋 ", " 望 ", " 妮侬 ", " 秋乃 ", " 真琴 ", " 静流 ", " 莫妮卡 ", " 姬塔 ", " 纯 ", " 亚里莎 "};
    public static final String[] noUpThree = {" 亚莉莎 ", " 杏奈 ", " 真步 ", " 璃乃 ", " 初音 ", " 依绪 ", " 望 ", " 妮侬 ", " 秋乃 ", " 真琴 ", " 静流 ", " 莫妮卡 ", " 姬塔 ", " 纯 "};
    public static final String[] Three_plus = {" 咲恋 "};
    public static final String[] two_plus = {" 绫音 "};
    public static final String[] one_plus = {" 胡桃 ", " 铃莓 "};
    public static final String helpMsg = " 命令总览：\n" +
            " 打 / 为管理员指令\n" +
            " 工会战命令:\n" +
            "\t1. 开始进行会战 [#开始记刀]\n" +
            "\t2. 结束会战 [#结束记刀]\n" +
            "\t3. 出完刀向机器人提交成绩 [#记刀 [尾刀] 伤害值]\n" +
            "\t\t 如果有自信不会挂树可以直接用这个命令提交伤害 \n" +
            "\t\t 但是如果挂了请注意不要透露给工会长自己的住宅地址，注意人身安全 \n" +
            "\t\t 尾刀 可选,统计时自动忽略次数 \n" +
            "\t4.* 撤除出刀资料 [/records remove QQ号 伤害值]\n" +
            "\t\t 有调整数据或者代替记刀的请通知管理,需要管理手动调整 \n" +
            "\t5. 查询今日全部成员出刀情况，[#查刀]\n" +
            " 杂项指令：\n" +
            "\t1. 抽一发井 (300 抽)[#(up) 井]\n" +
            "\t\t 带 up 就是 up 池，不带 up 就是白金池 \n" +
            "\t2. 抽一发十连 (10 抽)[#(up) 十连]\n" +
            "\t3. 抽 n 发 [#(up) 抽卡 n]\n" +
            "\t4. 生成 excel 统计表格 [生成 excel (时间)](待加入)\n" +
            "\t\t 时间参数与上面相同 \n" +
            "\t5. 在一个群里关闭 / 开启提醒买药小助手 [/reminder enable/disable]\n" +
            "\t6. 删除不需要记录的成员信息 [/member remove QQ号]\n" +
            "\t7. 查看当前正在记录的成员信息 [/member list]\n" +
            " 默认设定：\n" +
            "\t 这个插件和插件的所有功能都是开启的 \n" +
            "\t 每天 0 点检查工会战结束的工会 \n" +
            "\t 抽一发井是有冷却的，大概 2 分钟吧 \n" +
            "\t 只要是管理员就可以踢掉任何人（包括工会长(会长求别踢)）" +
            "\t (重要) 以上命令中,所有括号表示可选,不需要输入括号,空格请照原样输入";
    public static final String[] kimo_Definde = {"孝心变质的气息", "hentai，谁是你妈啦 ", " 死肥宅一边玩去啦，不要打扰我 ", " 本小姐不想理你，并向你扔了一只胖次 ",
            " 无应答......", " 嗷呜 %_%", " 谁是你妈啦，哼 ", " 对方无应答 ", " 你是个好人 ", " 对不起！您拨打的用户暂时无法接通，请稍后再拨.Sorry!The subscriber you dialed can not be connected for the moment, please redial later."
            , " 傲娇与偏见 "};
    public static final String[] responseStr = {"赣神魔,三刀出完了吗?", "妈还有事要做，没时间\n", "エラー発生", "让我看看是哪个小朋友又挂树了...啊?", "请去找淡茶真人热聊,服务器正在下锅", "你在说啥?咕嚕靈波（○′?‵）ノ?", "优衣对不起!...\n啥?"};
//    public static final String[] zuan = {"祖安大舞台，有吗你就来",
//            "顺风四海皆兄弟，逆风皆为猎马人",
//            "赢则双亲健在，输则族谱升天",
//            "我指间跳动的键盘，是你双亲闪烁的骨灰",
//            "我想给你吗送朵花，可是我没有花，可惜你没有吗",
//            "我想送你吗一朵花，哈哈开玩笑的，我哪来的花你哪来的吗",
//            "去拼多多拼个双亲再来跟爷说话",
//            "打团还在后面发呆，站那给你双亲吹唢呐？",
//            "你就好像那个野草成了精，兜兜转转找不到双亲",
//            "你在野区瞎溜达是在挑选给你吗守墓的礼物吗？",
//            "没事多看看天空，你吗可能在看你",
//            "千里马常有，你妈常没有",
//            "嘴巴这么毒，前男/女友尿毒症啊",
//            "天上的星星亮晶晶，好像你妈眨眼睛",
//            "话这么多，怎么不坐你吗坟头慢慢说",
//            "跟你吗打电话的时候记得先挂电话，不然你吗就挂了",
//            "不参团是在郊外旅游吗",
//            "妹妹嘴巴这么甜，前男友糖尿病吧",
//            "明年今日你双亲的坟头草应该很高了吧",
//            "真是狗嘴说不出人话",
//            "你自己拍张照，就是全家福",
//            "你赶紧去转发锦鲤保佑下你吗今晚少死几次好吗",
//            "几个吗啊这么嚣张",
//            "你不参团是在峡谷里贴瓷砖吗？",
//            "你和小兵的区别就是你会打字",
//            "今天想骂人，所以不骂你",
//            "哥哥，上手吧，别用脚玩了",
//            "你看好你的吗，不然下一秒你吗她就被挂在黄山迎客松喜迎八方来客",
//            "老子大团你清兵线你妈是有多缺钱",
//            "你再这样的话，你吗的葬礼我不去了",
//            "你在野区多逛逛看看那块地适合葬你吗",
//            "火葬场打电话问你，你吗要几分熟",
//            "恭祝您百病缠身，寿比昙花",
//            "你长着个脑袋是为了假装你是个人",
//            "你脖子上顶着的是肿瘤吗",
//            "咋的？你管的那么多呢？收粪车从你家门前路过你都要拿勺子尝尝咸淡？",
//            "刚刚火葬场来电话，说你吗粘锅了，让你去拼多多拼多个吗再来",
//            "我的五官是我爸妈给的，你的五官是你吗跟邻里街坊东拼西凑的",
//            "辅助你看这地图跟你吗的批一样黑",
//            "运送你吗的灵车撞死了你一家老小，真可谓是双喜临门",
//            "你再bb等你火化后给你撒田里当肥料不让你进祖坟你信不信",
//            "城外三十里的火光冲天，烧的是你母亲飘散的骨灰",
//            "上中野ad辅不来参团是在给你妈挖坟吗？",
//            "几个吗啊说话这么嚣张",
//            "我把你骨灰扬了让你死无葬身之地",
//            "你看起来好像没什么脑子，你妈妈一定走的很早，没来得及给你生个脑子",
//            "吃了你吗的骨灰说话那么冲？",
//            "我踏着你吗的棺材板冲浪你看见了吗",
//            "你吗在国产区火了",
//            "你吗今晚八点半在空中旋转三周半炸成一朵绚烂的烟花照亮祖国上空",
//            "记得晚上给你吗盖被子，小心你吗凉了",
//            "星星还是这么亮，你吗还是在天上",
//            "你可别送人头了，小兵的输出都比你高",
//            "打团不参加去野区干嘛，给你妈采灵芝吗",
//            "妹妹你脸这么白姐姐给你几个巴掌补补腮红",
//            "祝你吗缓缓炸开，化作天边最闪耀的烟火",
//            "不会做人别做人，去当个牲口闭嘴不好吗？",
//            "想起一生中最后悔的事就是没把你妈棺材撒满纸钱",
//            "等回头经济好点了去宠物店买个吗，别老一天天秀你那个可有可无的智商",
//            "亲妈挂树，尸块养猪，灵车漂移，坟头蹦迪，螺旋爆炸，砂纸磨逼，棺木冲浪，烈火烧逼，尸体泡茶",
//            "骨灰拌饭，祖坟歌会，入土派对，葬礼庆典，骨髓煮汤，脑浆浇花，棺木开花",
//            "你全家福照片上怎么就你一个人",
//            "你骂人的时候就用手打游戏就用脚",
//            "操着电线透你妈，一路闪电带火花",
//            "尘归尘土归土，孤儿不配有老母",
//            "你全家春晚在奈何桥边表演千手观音",
//            "劝你跟我速战速决，不然你就赶不上你吗的火化仪式了",
//            "我看见你吗的灵车刚刚开过去了，司机酗酒灵车漂移撞到你的野爹了，你吗骨灰飞舞张扬，野爹狂野暴毙当场",
//            "你爹不骂人还是你吗不上坟",
//            "我一把把你吗骨灰扬了作为凝结核形成降雨灌到你脑子里",
//            "你再多说两句你家人都要在坟里涌起一股神力把你拉进来风干挂起",
//            "你有这么多话就不能等你和你吗在黄泉团聚好好说吗",
//            "你非要骂我的话要先问问你棺材里的妈答不答应",
//            "今天解密千古悬案之你吗b里藏尸案",
//            "嘀嘀咕咕的说啥呢说话说不明白的是不是喊着你吗的b",
//            "最美的不是下雨天而是你的表字吗狗头落地的瞬间",
//            "我帮你转发两条锦鲤希望你吗今晚少死几次",
//            "少年强则国强，少年送你吗上天堂",
//            "我是你吗的黄泉引路人",
//            "你看看窗外哪棵树好看，我去把你吗挂上去",
//            "我生掀你吗的头盖骨",
//            "塞个猪脑都比原装强",
//            "你搁野区捉蛐蛐呢",
//            "上路死中路死，你吗死不死啊？",
//            "输真是吃了队友没妈的亏，没办法",
//            "你再互动你吗死后十年还得痔疮",
//            "你这三等残废操作笑死老子了",
//            "早点投降，放过彼此",
//            "吃那么多经济是用来买纸钱祭奠你双亲吗",
//            "再互动就让你吗九九归一，然后把你吗的头送给太上老君炼丹",
//            "杂种滚回你吗的子宫回炉重造",
//            "已知你嘴臭，你吗批臭，由此可知你舔过你吗批",
//            "我一刀把你吗一九分",
//            "我永远是对的，你吗永远过世了",
//            "我家小鲤鱼简直想在你吗臭嗨里历险",
//            "你是小次郎开坦克开到你吗批里转迷路了吗"};
//}
}

